src/Catalogs/уатСтатусы_уэ/уатСтатусы_уэ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатСтатусы_уэ</name>
  <comment>Статусы грузов и документов</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Аннулировано</name>
      <description>Аннулировано</description>
    </items>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>ВИсполнении</name>
      <description>В исполнении</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВыданВРейс</name>
      <description>Выдан в рейс</description>
    </items>
    <items>
      <name>ВыданСоСклада</name>
      <description>Выдан со склада</description>
    </items>
    <items>
      <name>ВыданСоСкладаКлиента</name>
      <description>Выдан со склада клиента</description>
    </items>
    <items>
      <name>Выполнен</name>
      <description>Выполнен</description>
    </items>
    <items>
      <name>Выпущен</name>
      <description>Выпущен</description>
    </items>
    <items>
      <name>Доставлен</name>
      <description>Доставлен</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Закрыт</name>
      <description>Закрыт</description>
    </items>
    <items>
      <name>МатериалыВыданы</name>
      <description>Материалы выданы</description>
    </items>
    <items>
      <name>НазначенРемонт</name>
      <description>Назначен ремонт</description>
    </items>
    <items>
      <name>НеПодтвержден</name>
      <description>Не подтвержден</description>
    </items>
    <items>
      <name>НеПройдено</name>
      <description>Не пройдено</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>ОбработкаЗавершена</name>
      <description>Обработка завершена</description>
    </items>
    <items>
      <name>Опубликовано</name>
      <description>Опубликовано</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Открыт</name>
      <description>Открыт</description>
    </items>
    <items>
      <name>Отправлен</name>
      <description>Отправлен</description>
    </items>
    <items>
      <name>ПовреждениеГруза</name>
      <description>Повреждение груза</description>
    </items>
    <items>
      <name>ПовреждениеУпаковки</name>
      <description>Повреждение упаковки</description>
    </items>
    <items>
      <name>Подтвержден</name>
      <description>Подтвержден</description>
    </items>
    <items>
      <name>ПодтвержденСЗамечаниями</name>
      <description>Подтвержден с замечаниями</description>
    </items>
    <items>
      <name>ПринятИзРейса</name>
      <description>Принят из рейса</description>
    </items>
    <items>
      <name>ПринятИзРейсаКлиентом</name>
      <description>Принят из рейса клиентом</description>
    </items>
    <items>
      <name>ДоставленНаСклад</name>
      <description>Принят на склад</description>
    </items>
    <items>
      <name>Пройдено</name>
      <description>Пройдено</description>
    </items>
    <items>
      <name>Размещен</name>
      <description>Размещен</description>
    </items>
    <items>
      <name>РазмещениеВКонтейнере</name>
      <description>Размещение в контейнере</description>
    </items>
    <items>
      <name>Разукомплектован</name>
      <description>Разукомплектован</description>
    </items>
    <items>
      <name>РемонтВыполнен</name>
      <description>Ремонт выполнен</description>
    </items>
    <items>
      <name>Скомплектован</name>
      <description>Скомплектован</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>Составной</name>
      <description>Составной</description>
    </items>
    <items>
      <name>Утвержден</name>
      <description>Утвержден</description>
    </items>
  </predefined>
  <attributes>
    <name>ДействуетНаАктыОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаАктыПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЗаказыГрузоотправителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЗаказыПеревозчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЗаявкиНаРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаОперацииСГрузами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаПотребностиВПеревозке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСопроводительныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенДляВыбораВМобильномПриложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСтраховыеСертификаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТендеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаЖурналыТранспортныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаПоУмолчанию</name>
    <comment>Цвет фона статуса для подсветки в списках по умолчанию</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаПоУмолчанию</name>
    <comment>Цвет фона статуса для подсветки в списках по умолчанию</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВладельца</name>
    <type>
      <types>EnumRef.уатВидыВладельцевСопроводительныхДокументов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/уатВидыВладельцевСопроводительныхДокументов/уатВидыВладельцевСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыВладельцевСопроводительныхДокументов</name>
  <enumValues>
    <name>ДокументыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ДокументыЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДокументы</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатСтатусы_уэ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Новый.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы = Истина;
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ОбработкаЗавершена.ПолучитьОбъект();
	СпрОбъект.ДействуетНаСопроводительныеДокументы = Истина;
	СпрОбъект.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ОбщиеДокументы;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Пройдено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.НеПройдено.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Аннулировано.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.Новый.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЖурналыТранспортныхДокументов = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.РазмещениеВКонтейнере.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(191, 220, 40), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ВыданСоСкладаКлиента.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(220, 40, 140), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатСтатусы_уэ.ПринятИзРейсаКлиентом.ПолучитьОбъект();
	СпрОбъект.ДействуетНаЗаказыГрузоотправителей = Истина;
	СпрОбъект.ЦветФонаПоУмолчанию   = Новый ХранилищеЗначения(Новый Цвет(70, 200, 70), Новый СжатиеДанных(9));
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
